Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: The following code demonstrates using the driver in :cpp:enumerator:`LV_DISPLAY_RENDER_MODE_DIRECT` mode.
it_it: Il codice seguente illustra l'utilizzo del driver in modalità :cpp:enumerator:`LV_DISPLAY_RENDER_MODE_DIRECT`.

source: The following code shows how to create a "Hello World" application:
it_it: Il codice seguente mostra come creare un'applicazione "Hello World":

source: The following color formats are supported by certain GPUs and are retained as color-format enumeration values that can be used when a GPU is going to be doing the drawing.
it_it: I seguenti formati di colore sono supportati da alcune GPU e vengono mantenuti come valori di enumerazione del formato colore utilizzabili quando una GPU esegue il disegno.

source: The following command installs the host packages based on an Ubuntu distribution
it_it: Il seguente comando installa i pacchetti host basati su una distribuzione Ubuntu

source: The following command outputs the current settings of the specified framebuffer device, such as resolution, pixel depth, and timings.
it_it: Il seguente comando restituisce le impostazioni correnti del dispositivo framebuffer specificato, come risoluzione, profondità di pixel e timing.

source: The following details apply to all types of Widgets.
it_it: I seguenti dettagli si applicano a tutti i tipi di widget.

source: The following event codes exist:
it_it: Esistono i seguenti codici evento:

source: The following events are emitted as part of scrolling:
it_it: I seguenti eventi vengono generati come parte dello scorrimento:

source: The following events are sent for Display (lv_display_t) objects:
it_it: I seguenti eventi vengono inviati per gli oggetti Display (lv_display_t):

source: The following example demonstrates parameter passing and the use of the ``text`` label property on a Component.
it_it: L'esempio seguente illustra il passaggio di parametri e l'utilizzo della proprietà dell'etichetta ``text`` su un Componente.

source: The following example draws the image as well.
it_it: L'esempio seguente disegna anche l'immagine.

source: The following flex related style properties exist:
it_it: Esistono le seguenti proprietà di stile relative a Flex:

source: The following fonts contain all ASCII characters, the degree symbol (U+00B0), the bullet symbol (U+2022) and the built-in symbols (see below).
it_it: I seguenti font contengono tutti i caratteri ASCII, il simbolo del grado (U+00B0), il simbolo del punto elenco (U+2022) e i simboli integrati (vedere di seguito).

source: The following functions are available to query mode properties:
it_it: Sono disponibili le seguenti funzioni per interrogare le proprietà della modalità:

source: The following functions are used for border drawing:
it_it: Per disegnare i bordi vengono utilizzate le seguenti funzioni:

source: The following functions are used for box shadow drawing:
it_it: Le seguenti funzioni vengono utilizzate per disegnare l'ombra di un rettangolo:

source: The following functions are used to get a Subject's current value:
it_it: Le seguenti funzioni vengono utilizzate per ottenere il valore corrente di un Subject:

source: The following functions are used to get a Subject's previous value:
it_it: Le seguenti funzioni vengono utilizzate per ottenere il valore precedente di un Subject:

source: The following functions are used to update a Subject's value:
it_it: Le seguenti funzioni vengono utilizzate per aggiornare il valore di un Subject:

source: The following functions can modify a color:
it_it: Le seguenti funzioni possono modificare un colore:

source: The following header modes exist:
it_it: Esistono le seguenti modalità di intestazione:

source: The following image pixel color formats have built-in decoding support:
it_it: I seguenti formati di colore dei pixel delle immagini supportano la decodifica nativa:

source: The following initialization functions exist, one for each of the Subject types:
it_it: Esistono le seguenti funzioni di inizializzazione, una per ciascun tipo di Subject:

source: The following is a simple make file for the example above, which builds for ARMv8 with the shared library:
it_it: Di seguito è riportato un semplice file make per l'esempio precedente, che compila per ARMv8 con la libreria "shared":

source: The following is an example of an array that could be used as the ``values`` argument in :cpp:func:`lv_obj_set_properties`:
it_it: Di seguito è riportato un esempio di array che potrebbe essere utilizzato come argomento ``values`` in :cpp:func:`lv_obj_set_properties`:

source: The following is an illustration of an API function prototype with documentation illustrating most of the Doxygen commands used in LVGL.
it_it: Di seguito è riportata l'illustrazione di un prototipo di funzione API con documentazione che illustra la maggior parte dei comandi Doxygen utilizzati in LVGL.

source: The following is an overview of how to integrate LVGL into your project.
it_it: Di seguito è riportata una panoramica su come integrare LVGL nel proprio progetto.

source: The following layers should be listed:
it_it: Dovrebbero essere elencati i seguenti layer:

source: The following method of subscribing to an integer Subject affects a Widget's :cpp:enumerator:`LV_STATE_CHECKED` state.
it_it: Il seguente metodo di sottoscrizione a un Subject intero influisce sullo stato :cpp:enumerator:`LV_STATE_CHECKED` di un Widget.

source: The following methods of subscribing to an integer Subject affect a Widget's flag (or OR-ed combination of flags).
it_it: I seguenti metodi di sottoscrizione a un Subject intero influenzano il flag di un Widget (o una combinazione di flag tramite OR).

source: The following methods of subscribing to an integer Subject affect a Widget's states (or OR-ed combination of states).
it_it: I seguenti metodi di sottoscrizione a un Subject intero influenzano gli stati di un Widget (o una combinazione di stati con OR).

source: The following methods of subscribing to an integer-type Subject associate the Observer with ONE of a Widget's properties as thought that property itself were the Observer.
it_it: I seguenti metodi di sottoscrizione a un Subject di tipo intero associano l'Observer a UNA delle proprietà di un Widget, come se la proprietà stessa fosse l'Observer.

source: The following modes are available:
it_it: Sono disponibili le seguenti modalità:

source: The following must be enabled.
it_it: È necessario abilitare quanto segue.

source: The following objects can be created so that it is easier to style the Menu:
it_it: È possibile creare i seguenti oggetti per semplificare la definizione dello stile del Menu:

source: The following pages will introduce features that are common to all widgets.
it_it: Le pagine seguenti presenteranno le funzionalità comuni a tutti i widget.

source: The following predefined parts exist in LVGL:
it_it: In LVGL sono presenti le seguenti parti predefinite:

source: The following root back button modes exist:
it_it: Esistono le seguenti modalità del pulsante "root back":

source: The following sections cover the LVGL drawing logic and how to use it and optionally tune it to fit your particular project (e.g. if you have a GPU or other resources that you would like to get involved).
it_it: Le sezioni seguenti illustrano la logica di disegno LVGL e come utilizzarla e, facoltativamente, adattarla al proprio progetto specifico (ad esempio, se si dispone di una GPU o di altre risorse da utilizzare).

source: The following sections describe the basic terminology and concepts of rendering.
it_it: Le sezioni seguenti descrivono la terminologia e i concetti di base del rendering.

source: The following show some example gradients.
it_it: Di seguito sono riportati alcuni esempi di gradienti.

source: The following simple built-in types are supported:
it_it: Sono supportati i seguenti tipi semplici nativi:

source: The following step types are currently supported (with example parameters):
it_it: Sono attualmente supportati i seguenti tipi di passi (con parametri di esempio):

source: The following structure should be used:
it_it: È necessario utilizzare la seguente struttura:

source: The following style properties trigger the creation of a "Simple Layer":
it_it: Le seguenti proprietà di stile attivano la creazione di un "Layer Semplice":

source: The following style properties trigger the creation of a "Transform Layer":
it_it: Le seguenti proprietà di stile attivano la creazione di un "Layer di Trasformazione":

source: The following targets are available.
it_it: Sono disponibili i seguenti target.

source: The following transition types exist:
it_it: Esistono i seguenti tipi di transizione:

source: The following values can be retrieved from it:
it_it: Da esso si possono recuperare i seguenti valori:

source: The following values can be used for the direction:
it_it: Per la direzione è possibile utilizzare i seguenti valori:

source: The font backend will select the supported parameters by itself and ignore the unsupported parameters.
it_it: Il backend font selezionerà autonomamente i parametri supportati e ignorerà quelli non supportati.

source: The font management functions currently provided include:
it_it: Le funzioni di gestione font attualmente disponibili includono:

source: The font manager is a secondary encapsulation of the LVGL font engine, which facilitates the use and management of fonts for applications.
it_it: Il Font Manager è una incapsulazione secondaria del motore dei font LVGL, che facilita l'uso e la gestione dei font per le applicazioni.

source: The font manager will check the reference status of all allocated fonts.
it_it: Il font manager verificherà lo stato di riferimento di tutti i font allocati.

source: The font manager will mark the font resource as a recyclable font so that it has the possibility of being more quickly created next time.
it_it: Il font manager contrassegnerà la risorsa font come font riciclabile in modo che possa essere creata più rapidamente la prossima volta.

source: The font needs to be in the same format as if it were loaded from a file.
it_it: Il font deve essere nello stesso formato in cui si troverebbe se fosse caricato da un file.

source: The font needs to have a special binary format.
it_it: Il font deve avere un formato binario speciale.

source: The font paths will then be appended to this base path.
it_it: I path dei font verranno quindi aggiunti a questo percorso di base.

source: The font style supports *Italic* and **Bold** fonts processed by software, and can be set by using following values where style values are required:
it_it: Lo stile del font supporta il font *Corsivo* e il **Grassetto** elaborati dal software e può essere impostato utilizzando i seguenti valori, laddove richiesti:

source: The font will be loaded by :cpp:expr:`lv_binfont_create`.
it_it: Il font verrà caricato tramite :cpp:expr:`lv_binfont_create`.

source: The fonts can have relative paths in ``globals.xml``.
it_it: I font possono avere path relativi in ``globals.xml``.

source: The foreground (indicator) can be touch-adjusted.
it_it: L'arco in primo piano (indicatore) può essere regolato tramite "touch".

source: The fragment's view hierarchy becomes part of, or attaches to, the host's view hierarchy.
it_it: La gerarchia di visualizzazione del frammento diventa parte o si collega alla gerarchia di visualizzazione dell'host.

source: The framework uses a pipeline model where media data flows from source elements through various processing elements (decoders, converters, filters) to sink elements (display, speakers, files).
it_it: Il framework utilizza un modello di pipeline in cui i dati multimediali fluiscono dagli elementi sorgente attraverso vari elementi di elaborazione (decodificatori, convertitori, filtri) fino agli elementi sink (display, altoparlanti, file).

source: The frogfs in LVGL does not have the decompression support that the upstream frogfs has.
it_it: Il frogfs in LVGL non supporta la decompressione come il frogfs upstream.

source: The full list of extensions required can be found `here <https://gen.glad.sh/#generator=c&api=egl%3D1.5%2Cgles2%3D2.0&profile=gl%3Dcompatibility%2Cgles1%3Dcommon&extensions=EGL_EXT_image_dma_buf_import%2CEGL_EXT_image_dma_buf_import_modifiers%2CEGL_EXT_platform_base%2CEGL_EXT_platform_wayland%2CEGL_KHR_fence_sync%2CEGL_KHR_image_base%2CEGL_KHR_platform_gbm%2CEGL_KHR_platform_wayland%2CGL_APPLE_texture_max_level%2CGL_ARM_rgba8%2CGL_EXT_color_buffer_float%2CGL_EXT_color_buffer_half_float%2CGL_EXT_texture_format_BGRA8888%2CGL_EXT_texture_storage%2CGL_EXT_unpack_subimage%2CGL_OES_depth24%2CGL_OES_mapbuffer%2CGL_OES_rgb8_rgba8%2CGL_OES_texture_float%2CGL_OES_texture_half_float%2CGL_OES_texture_storage_multisample_2d_array%2CGL_OES_vertex_array_object&options=ALIAS>`__.
it_it: L'elenco completo delle estensioni richieste può essere trovato `qui <https://gen.glad.sh/#generator=c&api=egl%3D1.5%2Cgles2%3D2.0&profile=gl%3Dcompatibility%2Cgles1%3Dcommon&extensions=EGL_EXT_image_dma_buf_import%2CEGL_EXT_image_dma_buf_import_modifiers%2CEGL_EXT_platform_base%2CEGL_EXT_platform_wayland%2CEGL_KHR_fence_sync%2CEGL_KHR_image_base%2CEGL_KHR_platform_gbm%2CEGL_KHR_platform_wayland%2CGL_APPLE_texture_max_level%2CGL_ARM_rgba8%2CGL_EXT_color_buffer_float%2CGL_EXT_color_buffer_half_float%2CGL_EXT_texture_format_BGRA8888%2CGL_EXT_texture_storage%2CGL_EXT_unpack_subimage%2CGL_OES_depth24%2CGL_OES_mapbuffer%2CGL_OES_rgb8_rgba8%2CGL_OES_texture_float%2CGL_OES_texture_half_float%2CGL_OES_texture_storage_multisample_2d_array%2CGL_OES_vertex_array_object&options=ALIAS>`__.

source: The function assumes that the buffer width and height are rounded to a multiple of 8.
it_it: La funzione presuppone che la larghezza e l'altezza del buffer siano arrotondate a un multiplo di 8.

source: The function below associates a Widget with an Observer while subscribing to a Subject.
it_it: La funzione seguente associa un Widget a un Observer durante l'iscrizione a un Subject.

source: The function pointer member receives the same struct as its **first** argument
it_it: Il membro puntatore a funzione riceve la stessa struct come suo **primo** argomento

source: The function subscribes to a Subject additionally associates the Observer with a pointer to any type of object, a copy of which is saved in the Observer's ``target`` field.
it_it: La funzione sottoscrive un Subject e associa inoltre l'Observer a un puntatore a qualsiasi tipo di oggetto, una copia del quale viene salvata nel campo ``target``.

source: The functions :cpp:func:`lv_draw_eve_memread8`, :cpp:func:`lv_draw_eve_memread16`, :cpp:func:`lv_draw_eve_memread32`, :cpp:func:`lv_draw_eve_memwrite8`, :cpp:func:`lv_draw_eve_memwrite16`, and :cpp:func:`lv_draw_eve_memwrite32` are available if needed.
it_it: Le funzioni :cpp:func:`lv_draw_eve_memread8`, :cpp:func:`lv_draw_eve_memread16`, :cpp:func:`lv_draw_eve_memread32`, :cpp:func:`lv_draw_eve_memwrite8`, :cpp:func:`lv_draw_eve_memwrite16` e :cpp:func:`lv_draw_eve_memwrite32` sono disponibili se necessario.

source: The functions below cause the parent Widget to become a Flex container if it is not already.
it_it: Le funzioni seguenti fanno sì che il Widget genitore diventi un contenitore Flex, se non lo è già.

source: The functions below cause the parent Widget to become a Grid container if it is not already.
it_it: Le funzioni seguenti fanno sì che il Widget padre diventi un contenitore Grid, se non lo è già.

source: The generated C files are compiled and linked into the resulting executable like any other ``const`` data.
it_it: I file C generati vengono compilati e linkati all'eseguibile risultante come qualsiasi altro dato ``const``.

source: The generated STM32 HAL code should initialize the I2C peripheral for you based on the configuration values in STM32CubeIDE or STM32CubeMX.
it_it: Il codice HAL STM32 generato dovrebbe inizializzare la periferica I2C in base ai valori di configurazione in STM32CubeIDE o STM32CubeMX.

source: The generated STM32 HAL code should initialize the SPI peripheral for you based on the configuration values in STM32CubeIDE or STM32CubeMX.
it_it: Il codice HAL STM32 generato dovrebbe inizializzare la periferica SPI in base ai valori di configurazione in STM32CubeIDE o STM32CubeMX.

source: The generated files end with ``_gen.c`` or ``_gen.h``.
it_it: I file generati terminano con ``_gen.c`` o ``_gen.h``.

source: The generic OpenGL driver offers support for creating LVGL displays as OpenGL textures that can be embedded in existing OpenGL applications.
it_it: Il driver OpenGL generico offre supporto per la creazione di display LVGL come texture OpenGL integrabili in applicazioni OpenGL esistenti.

source: The gesture recognizers can be configured to modify the gesture thresholds:
it_it: I riconoscitori dei gesti possono essere configurati per modificare le soglie dei gesti:

source: The glTF extension in LVGL provides 3D model loading, rendering, and animation capabilities.
it_it: L'estensione glTF in LVGL offre funzionalità di caricamento, rendering e animazione di modelli 3D.

source: The glTF extension relies on **OpenGL ES 2.0** with some extension support for 3D rendering.
it_it: L'estensione glTF si basa su **OpenGL ES 2.0** con supporto per alcune estensioni per il rendering 3D.

source: The glTF extension requires the following external libraries:
it_it: L'estensione glTF richiede le seguenti librerie esterne:

source: The glTF module provides support for loading and rendering 3D models using the glTF 2.0 specification within LVGL applications.
it_it: Il modulo glTF fornisce supporto per il caricamento e il rendering di modelli 3D utilizzando la specifica glTF 2.0 all'interno di applicazioni LVGL.

source: The glTF viewer provides comprehensive camera controls:
it_it: Il visualizzatore glTF offre controlli telecamera completi:

source: The glTF widget extends the ``lv_3dtexture`` widget, which means:
it_it: Il widget glTF estende il widget ``lv_3dtexture``, il che significa:

source: The glue code updates it when the callback is registered, and uses it when the callback is called in order to invoke a call to the original callable object.
it_it: Il codice "collante" lo aggiorna quando la callback viene registrata e lo utilizza quando la callback viene chiamata per invocare una chiamata all'oggetto richiamabile originale.

source: The goal is to create textures that people can embed in other applications.
it_it: L'obiettivo è creare texture che gli utenti possano incorporare in altre applicazioni.

source: The goal of this guide is to ensure a simple integration between a Zephyr project and the LVGL Editor.
it_it: L'obiettivo di questa guida è garantire una semplice integrazione tra un progetto Zephyr e l'editor LVGL.

source: The gradient will be calculated between the focal point's circle and the edge of the outer circle.
it_it: Il gradiente verrà calcolato tra il cerchio del punto focale e il bordo del cerchio esterno.

source: The graphics library itself is the ``lvgl`` directory.
it_it: La libreria grafica vera e propria si trova nella directory ``lvgl``.

source: The ideal tile size is calculated as ``ideal_tile_size = draw_buf_size / tile_cnt``.
it_it: La dimensione ideale del tile è calcolata come ``ideal_tile_size = draw_buf_size / tile_cnt``.

source: The image is now ready to be deployed on the device.
it_it: L'immagine è ora pronta per essere distribuita sul dispositivo.

source: The image source, either a pointer to `lv_image_dsc_t` or a file path.
it_it: L'origine dell'immagine, un puntatore a `lv_image_dsc_t` o un path di un file.

source: The image sources set for state :cpp:enumerator:`LV_IMAGEBUTTON_STATE_RELEASED` are used for any state that has not had image sources set for it.
it_it: Le sorgenti di immagini impostate per lo stato :cpp:enumerator:`LV_IMAGEBUTTON_STATE_RELEASED` vengono utilizzate per qualsiasi stato per il quale non siano state impostate sorgenti immagine.

source: The image sources work the same as described in the :ref:`Image Widget <lv_image>` except that "Symbols" are not supported by the Image Button.
it_it: Le sorgenti delle immagini funzionano come descritto nel :ref:`Widget Image <lv_image>` con la differenza che i "Simboli" non sono supportati dall'Image Button.

source: The image will look exactly like the Widget on the display.
it_it: L'immagine apparirà esattamente come il Widget sul display.

source: The images are built with the following command:
it_it: Le immagini vengono compilate con il seguente comando:

source: The images can have relative paths in ``globals.xml``.
it_it: Le immagini possono avere path relativi in ``globals.xml``.

source: The images module supports images in any of 3 forms:
it_it: Il modulo immagini supporta immagini in 3 formati:

source: The implementation is documented below.
it_it: L'implementazione è documentata di seguito.

source: The implementation uses the `AnimatedGIF <https://github.com/bitbank2/AnimatedGIF/tree/master>`__ library.
it_it: L'implementazione utilizza la libreria `AnimatedGIF <https://github.com/bitbank2/AnimatedGIF/tree/master>`__ library.

source: The implication of this is that a reduced color depth will be realized on the display compared to the original asset.
it_it: Ciò implica che sul display verrà visualizzata una profondità di colore ridotta rispetto alla risorsa originale.

source: The important files for us are ``local.conf`` and ``bblayers.conf``
it_it: I file importanti per noi sono ``local.conf`` e ``bblayers.conf``

source: The included themes are enabled in ``lv_conf.h``.
it_it: I temi inclusi sono abilitati in ``lv_conf.h``.

source: The index of the pressed button should be set in ``data->btn_id`` in the ``read_cb``.
it_it: L'indice del pulsante premuto deve essere impostato in ``data->btn_id`` in ``read_cb``.

source: The indicator Arc is drawn on the main part's Arc.
it_it: L'Arco indicatore viene disegnato sull'Arco della parte principale.

source: The initial asset upload time may also be longer.
it_it: Anche il tempo di caricamento iniziale della risorsa potrebbe essere più lungo.

source: The inner circle (focal point) can be set with: :cpp:expr:`lv_grad_radial_set_focal(&grad_dsc, center_x, center_y, radius)`
it_it: Il cerchio interno (punto focale) può essere impostato con: :cpp:expr:`lv_grad_radial_set_focal(&grad_dsc, center_x, center_y, radius)`

source: The intensity of mixing of color filter.
it_it: Intensità di miscelazione del filtro colore.

source: The internal (pixel array) and external images support 2 transparency handling methods:
it_it: Le immagini interne (array di pixel) ed esterne supportano 2 metodi di gestione della trasparenza:

source: The interpreter of Berry include a one-pass compiler and register-based VM, all the code is written in ANSI C99.
it_it: L'interprete di Berry include un compilatore one-pass e una VM basata su registri; tutto il codice è scritto in ANSI C99.

source: The item in the middle is the selected item and normally stands out from the other items due to different styles applied to it.
it_it: L'elemento al centro è quello selezionato e normalmente si distingue dagli altri per i diversi stili applicati.

source: The items on ``ROW`` layouts, and tracks of ``COLUMN`` layouts will be placed from right to left.
it_it: Gli elementi nei layout ``ROW`` e le track di ``COLUMN`` verranno posizionati da destra a sinistra.

# The items should be separated by `` ``.
source: The items should be separated by ``\n``.
it_it: Gli elementi devono essere separati da ``\n``.

source: The knob can be dragged to set the Slider's value.
it_it: La manopola può essere trascinata per impostare il valore dello Slider.

source: The knob can be made larger with the ``padding`` values.
it_it: La manopola può essere ingrandita con i valori di ``padding``.
